src/templates_memory/templator_memory.org
# TREXIO in-memory (RAM) back end
#
# Same-process, disk-free back end: all data lives in the open handle. It
# mirrors the TEXT back end but with no file I/O: reading a group returns the
# in-RAM struct (an empty one if not yet present), and flushing is a no-op.
# The struct-based categories (numerical attributes, numerical/string
# datasets, string attributes) are stored in per-group structs; sparse,
# buffered and determinant data are stored in a generic name-keyed blob store
# on the handle. All data categories are therefore supported.

* Constant file prefixes (not used by the generator)               :noexport:

  #+begin_src c :tangle prefix_memory.h :noweb yes
<<header>>
#ifndef TREXIO_MEMORY_H
#define TREXIO_MEMORY_H

#include "trexio.h"
#include "trexio_private.h"
#include "trexio_s.h"
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <inttypes.h>

/* Generic in-RAM storage for the categories that the TEXT back end keeps in
   separate files: sparse datasets, buffered vectors and the determinant list.
   Each "blob" holds the growable arrays for one such dataset, looked up by
   name. This avoids adding per-dataset fields to the generated group structs. */
typedef struct trexio_mem_blob_s {
  char      name[256];
  int32_t*  index;     /* sparse: n_items * rank indices               */
  int64_t*  list;      /* determinant: n_items * rank bit-field ints   */
  double*   value;     /* sparse / buffered values (n_items)           */
  int64_t   n_items;
  int64_t   capacity;
  int32_t   rank;      /* indices per item (sparse) or ints/det (list) */
  struct trexio_mem_blob_s* next;
} trexio_mem_blob_t;

  #+end_src

  #+begin_src c :tangle prefix_memory.c :noweb yes
/* This file was generated from the templator_memory.org org-mode file.
   To generate it, run M-x org-babel-tangle in Emacs.
*/

#include "trexio_memory.h"

  #+end_src

* Template for group-related structures in memory back end

    #+begin_src c :tangle struct_memory_group_dset.h
typedef struct $group$_mem_s {
  $group_num_dtype_double$ $group_num$;
  $group_dset_dtype$*  $group_dset$;
  uint64_t dims_$group_dset$[16];
  uint64_t len_$group_str$;
  uint32_t rank_$group_dset$;
  uint32_t to_flush;
  bool $group_num$_isSet;
  char*    $group_str$;
} $group$_mem_t;
    #+end_src

* Template for general structure in memory back end

   Polymorphism of the ~trexio_t~ type is handled by ensuring that the
   back-end struct starts with a ~trexio_t parent~ attribute, so it can be
   safely cast to ~trexio_t~.

    #+begin_src c :tangle struct_memory_group.h
typedef struct trexio_memory_s {
  trexio_t   parent ;
  trexio_mem_blob_t* blobs;
  $group$_mem_t* $group$;
} trexio_memory_t;
    #+end_src

