templator_memory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-26 Fri 11:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8cdf732">1. Template for group-related structures in memory back end</a></li>
<li><a href="#org4f961ef">2. Template for general structure in memory back end</a></li>
<li><a href="#org6a76ebb">3. Initialize function (constant part)</a></li>
<li><a href="#orgc79375f">4. Deinitialize function (templated part)</a></li>
<li><a href="#orge4b87c9">5. Flush function (templated part)</a></li>
<li><a href="#orgad1b834">6. Template for memory read a group</a></li>
<li><a href="#orgace0509">7. Template for memory has a group</a></li>
<li><a href="#org3f85674">8. Template for memory flush a group</a></li>
<li><a href="#orgc7aa26e">9. Template for memory free memory</a></li>
<li><a href="#org678e6e3">10. Template for has/read/write a numerical attribute</a></li>
<li><a href="#org3532b76">11. Template for has/read/write a dataset of numerical data</a></li>
<li><a href="#org33d7876">12. Template for has/read/write a dataset of strings</a></li>
<li><a href="#org89c6fea">13. Template for has/read/write a string attribute</a></li>
<li><a href="#org61bdb8c">14. Template for memory delete a group (UNSAFE mode)</a></li>
<li><a href="#org7ba975d">15. Template for has/read/write the dataset of sparse data</a></li>
<li><a href="#org6f151d6">16. Template for has/read/write a buffered vector</a></li>
<li><a href="#orgd5d8a4a">17. Source code for the determinant part</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8cdf732" class="outline-2">
<h2 id="org8cdf732"><span class="section-number-2">1.</span> Template for group-related structures in memory back end</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> $group$_mem_s {
  $group_num_dtype_double$ $group_num$;
  $group_dset_dtype$*  $group_dset$;
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dims_$group_dset$</span>[16];
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">len_$group_str$</span>;
  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank_$group_dset$</span>;
  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">to_flush</span>;
  bool $group_num$_isSet;
  <span style="color: #228b22;">char</span>*    $group_str$;
} $group$_mem_t;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f961ef" class="outline-2">
<h2 id="org4f961ef"><span class="section-number-2">2.</span> Template for general structure in memory back end</h2>
<div class="outline-text-2" id="text-2">
<p>
Polymorphism of the <code>trexio_t</code> type is handled by ensuring that the
back-end struct starts with a <code>trexio_t parent</code> attribute, so it can be
safely cast to <code>trexio_t</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">trexio_memory_s</span> {
  <span style="color: #228b22;">trexio_t</span>   <span style="color: #a0522d;">parent</span> ;
  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">blobs</span>;
  $group$_mem_t* $group$;
} <span style="color: #228b22;">trexio_memory_t</span>;
</pre>
</div>
</div>
</div>
