src/templates_memory/templator_memory.org
* Initialize function (constant part)

    #+begin_src c :tangle basic_memory.h :exports none
trexio_exit_code trexio_memory_init(trexio_t* const file);
trexio_exit_code trexio_memory_inquire(const char* file_name);
trexio_exit_code trexio_memory_deinit(trexio_t* const file);
trexio_exit_code trexio_memory_lock(trexio_t* const file);
trexio_exit_code trexio_memory_unlock(trexio_t* const file);
trexio_exit_code trexio_memory_flush(trexio_t* const file);

/* In-RAM blob store helpers (sparse / buffered / determinant). */
trexio_mem_blob_t* trexio_mem_blob_find(trexio_memory_t* const file, const char* name);
trexio_mem_blob_t* trexio_mem_blob_get(trexio_memory_t* const file, const char* name, const int32_t rank);
void trexio_mem_blob_free_all(trexio_memory_t* const file);
trexio_exit_code trexio_mem_blob_append_sparse(trexio_mem_blob_t* const b, const int64_t size, const int32_t* index, const double* value);
trexio_exit_code trexio_mem_blob_read_sparse(const trexio_mem_blob_t* const b, const int64_t offset, const int64_t size, int32_t* const index, double* const value, int64_t* const eof);
trexio_exit_code trexio_mem_blob_append_value(trexio_mem_blob_t* const b, const int64_t size, const double* value);
trexio_exit_code trexio_mem_blob_read_value(const trexio_mem_blob_t* const b, const int64_t offset, const int64_t size, double* const value, int64_t* const eof);
trexio_exit_code trexio_mem_blob_append_list(trexio_mem_blob_t* const b, const int64_t size, const int64_t* list);
trexio_exit_code trexio_mem_blob_read_list(const trexio_mem_blob_t* const b, const int64_t offset, const int64_t size, int64_t* const list, int64_t* const eof);
    #+end_src

    #+begin_src c :tangle basic_memory.c
trexio_mem_blob_t*
trexio_mem_blob_find (trexio_memory_t* const file, const char* name)
{
  trexio_mem_blob_t* b = file->blobs;
  while (b != NULL) {
    if (strncmp(b->name, name, sizeof(b->name)) == 0) return b;
    b = b->next;
  }
  return NULL;
}

trexio_mem_blob_t*
trexio_mem_blob_get (trexio_memory_t* const file, const char* name, const int32_t rank)
{
  trexio_mem_blob_t* b = trexio_mem_blob_find(file, name);
  if (b != NULL) return b;
  b = (trexio_mem_blob_t*) calloc(1, sizeof(trexio_mem_blob_t));
  if (b == NULL) return NULL;
  strncpy(b->name, name, sizeof(b->name)-1);
  b->name[sizeof(b->name)-1] = '\0';
  b->rank = rank;
  b->next = file->blobs;
  file->blobs = b;
  return b;
}

void
trexio_mem_blob_free_all (trexio_memory_t* const file)
{
  trexio_mem_blob_t* b = file->blobs;
  while (b != NULL) {
    trexio_mem_blob_t* next = b->next;
    free(b->index);
    free(b->list);
    free(b->value);
    free(b);
    b = next;
  }
  file->blobs = NULL;
}

/* Grow the blob to hold at least `need` items. */
static trexio_exit_code
trexio_mem_blob_reserve (trexio_mem_blob_t* const b, const int64_t need,
                         const bool want_index, const bool want_list, const bool want_value)
{
  if (need <= b->capacity) return TREXIO_SUCCESS;
  int64_t cap = (b->capacity > 0) ? b->capacity : 1024L;
  while (cap < need) cap *= 2L;

  if (want_index) {
    int32_t* p = (int32_t*) realloc(b->index, (size_t) cap * (size_t) b->rank * sizeof(int32_t));
    if (p == NULL) return TREXIO_ALLOCATION_FAILED;
    b->index = p;
  }
  if (want_list) {
    int64_t* p = (int64_t*) realloc(b->list, (size_t) cap * (size_t) b->rank * sizeof(int64_t));
    if (p == NULL) return TREXIO_ALLOCATION_FAILED;
    b->list = p;
  }
  if (want_value) {
    double* p = (double*) realloc(b->value, (size_t) cap * sizeof(double));
    if (p == NULL) return TREXIO_ALLOCATION_FAILED;
    b->value = p;
  }
  b->capacity = cap;
  return TREXIO_SUCCESS;
}

trexio_exit_code
trexio_mem_blob_append_sparse (trexio_mem_blob_t* const b, const int64_t size,
                               const int32_t* index, const double* value)
{
  trexio_exit_code rc = trexio_mem_blob_reserve(b, b->n_items + size, true, false, true);
  if (rc != TREXIO_SUCCESS) return rc;
  memcpy(b->index + b->n_items * b->rank, index, (size_t) size * (size_t) b->rank * sizeof(int32_t));
  memcpy(b->value + b->n_items, value, (size_t) size * sizeof(double));
  b->n_items += size;
  return TREXIO_SUCCESS;
}

trexio_exit_code
trexio_mem_blob_read_sparse (const trexio_mem_blob_t* const b, const int64_t offset, const int64_t size,
                             int32_t* const index, double* const value, int64_t* const eof)
{
  if (b == NULL || offset >= b->n_items) { *eof = 0L; return TREXIO_END; }
  const int64_t avail = b->n_items - offset;
  const int64_t n = (size <= avail) ? size : avail;
  memcpy(index, b->index + offset * b->rank, (size_t) n * (size_t) b->rank * sizeof(int32_t));
  memcpy(value, b->value + offset, (size_t) n * sizeof(double));
  if (n < size) { *eof = n; return TREXIO_END; }
  return TREXIO_SUCCESS;
}

trexio_exit_code
trexio_mem_blob_append_value (trexio_mem_blob_t* const b, const int64_t size, const double* value)
{
  trexio_exit_code rc = trexio_mem_blob_reserve(b, b->n_items + size, false, false, true);
  if (rc != TREXIO_SUCCESS) return rc;
  memcpy(b->value + b->n_items, value, (size_t) size * sizeof(double));
  b->n_items += size;
  return TREXIO_SUCCESS;
}

trexio_exit_code
trexio_mem_blob_read_value (const trexio_mem_blob_t* const b, const int64_t offset, const int64_t size,
                            double* const value, int64_t* const eof)
{
  if (b == NULL || offset >= b->n_items) { *eof = 0L; return TREXIO_END; }
  const int64_t avail = b->n_items - offset;
  const int64_t n = (size <= avail) ? size : avail;
  memcpy(value, b->value + offset, (size_t) n * sizeof(double));
  if (n < size) { *eof = n; return TREXIO_END; }
  return TREXIO_SUCCESS;
}

trexio_exit_code
trexio_mem_blob_append_list (trexio_mem_blob_t* const b, const int64_t size, const int64_t* list)
{
  trexio_exit_code rc = trexio_mem_blob_reserve(b, b->n_items + size, false, true, false);
  if (rc != TREXIO_SUCCESS) return rc;
  memcpy(b->list + b->n_items * b->rank, list, (size_t) size * (size_t) b->rank * sizeof(int64_t));
  b->n_items += size;
  return TREXIO_SUCCESS;
}

trexio_exit_code
trexio_mem_blob_read_list (const trexio_mem_blob_t* const b, const int64_t offset, const int64_t size,
                           int64_t* const list, int64_t* const eof)
{
  if (b == NULL || offset >= b->n_items) { *eof = 0L; return TREXIO_END; }
  const int64_t avail = b->n_items - offset;
  const int64_t n = (size <= avail) ? size : avail;
  memcpy(list, b->list + offset * b->rank, (size_t) n * (size_t) b->rank * sizeof(int64_t));
  if (n < size) { *eof = n; return TREXIO_END; }
  return TREXIO_SUCCESS;
}
    #+end_src

    #+begin_src c :tangle basic_memory.c
trexio_exit_code
trexio_memory_inquire (const char* file_name)
{
  /* In-memory files do not persist on disk and are never pre-existing. */
  (void) file_name;
  return TREXIO_FAILURE;
}
    #+end_src

    #+begin_src c :tangle basic_memory.c
trexio_exit_code
trexio_memory_init (trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  trexio_memory_t* const f = (trexio_memory_t*) file;

  /* Put all pointers to NULL but leave parent untouched */
  memset(&(f->parent)+1, 0, sizeof(trexio_memory_t)-sizeof(trexio_t));

  return TREXIO_SUCCESS;
}
    #+end_src

    #+begin_src c :tangle basic_memory.c
trexio_exit_code
trexio_memory_lock (trexio_t* const file)
{
  /* Nothing to lock for an in-memory, single-process file. */
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  return TREXIO_SUCCESS;
}
    #+end_src

    #+begin_src c :tangle basic_memory.c
trexio_exit_code
trexio_memory_unlock (trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  return TREXIO_SUCCESS;
}
    #+end_src

