templator_memory.html

<div id="outline-container-org6a76ebb" class="outline-2">
<h2 id="org6a76ebb"><span class="section-number-2">3.</span> Initialize function (constant part)</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_mem_blob_t</span>*
<span style="color: #0000ff;">trexio_mem_blob_find</span> (<span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">name</span>)
{
  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = file-&gt;blobs;
  <span style="color: #a020f0;">while</span> (b != <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">if</span> (strncmp(b-&gt;name, name, <span style="color: #a020f0;">sizeof</span>(b-&gt;name)) == 0) <span style="color: #a020f0;">return</span> b;
    b = b-&gt;next;
  }
  <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
}

<span style="color: #228b22;">trexio_mem_blob_t</span>*
<span style="color: #0000ff;">trexio_mem_blob_get</span> (<span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">name</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">rank</span>)
{
  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find(file, name);
  <span style="color: #a020f0;">if</span> (b != <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> b;
  b = (<span style="color: #228b22;">trexio_mem_blob_t</span>*) calloc(1, <span style="color: #a020f0;">sizeof</span>(trexio_mem_blob_t));
  <span style="color: #a020f0;">if</span> (b == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  strncpy(b-&gt;name, name, <span style="color: #a020f0;">sizeof</span>(b-&gt;name)-1);
  b-&gt;name[<span style="color: #a020f0;">sizeof</span>(b-&gt;name)-1] = <span style="color: #8b2252;">'\0'</span>;
  b-&gt;rank = rank;
  b-&gt;next = file-&gt;blobs;
  file-&gt;blobs = b;
  <span style="color: #a020f0;">return</span> b;
}

<span style="color: #228b22;">void</span>
<span style="color: #0000ff;">trexio_mem_blob_free_all</span> (<span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = file-&gt;blobs;
  <span style="color: #a020f0;">while</span> (b != <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">next</span> = b-&gt;next;
    free(b-&gt;index);
    free(b-&gt;list);
    free(b-&gt;value);
    free(b);
    b = next;
  }
  file-&gt;blobs = <span style="color: #008b8b;">NULL</span>;
}

/* <span style="color: #b22222;">Grow the blob to hold at least `need` items.</span> */
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_mem_blob_reserve</span> (<span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">b</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">need</span>,
                         <span style="color: #a020f0;">const</span> <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">want_index</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">want_list</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">want_value</span>)
{
  <span style="color: #a020f0;">if</span> (need &lt;= b-&gt;capacity) <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">cap</span> = (b-&gt;capacity &gt; 0) ? b-&gt;capacity : 1024L;
  <span style="color: #a020f0;">while</span> (cap &lt; need) cap *= 2L;

  <span style="color: #a020f0;">if</span> (want_index) {
    <span style="color: #228b22;">int32_t</span>* <span style="color: #a0522d;">p</span> = (<span style="color: #228b22;">int32_t</span>*) realloc(b-&gt;index, (<span style="color: #228b22;">size_t</span>) cap * (<span style="color: #228b22;">size_t</span>) b-&gt;rank * <span style="color: #a020f0;">sizeof</span>(int32_t));
    <span style="color: #a020f0;">if</span> (p == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;
    b-&gt;index = p;
  }
  <span style="color: #a020f0;">if</span> (want_list) {
    <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">p</span> = (<span style="color: #228b22;">int64_t</span>*) realloc(b-&gt;list, (<span style="color: #228b22;">size_t</span>) cap * (<span style="color: #228b22;">size_t</span>) b-&gt;rank * <span style="color: #a020f0;">sizeof</span>(int64_t));
    <span style="color: #a020f0;">if</span> (p == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;
    b-&gt;list = p;
  }
  <span style="color: #a020f0;">if</span> (want_value) {
    <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">p</span> = (<span style="color: #228b22;">double</span>*) realloc(b-&gt;value, (<span style="color: #228b22;">size_t</span>) cap * <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));
    <span style="color: #a020f0;">if</span> (p == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;
    b-&gt;value = p;
  }
  b-&gt;capacity = cap;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_mem_blob_append_sparse</span> (<span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">b</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span>* <span style="color: #a0522d;">index</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">value</span>)
{
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = trexio_mem_blob_reserve(b, b-&gt;n_items + size, <span style="color: #008b8b;">true</span>, <span style="color: #008b8b;">false</span>, <span style="color: #008b8b;">true</span>);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;
  memcpy(b-&gt;index + b-&gt;n_items * b-&gt;rank, index, (<span style="color: #228b22;">size_t</span>) size * (<span style="color: #228b22;">size_t</span>) b-&gt;rank * <span style="color: #a020f0;">sizeof</span>(int32_t));
  memcpy(b-&gt;value + b-&gt;n_items, value, (<span style="color: #228b22;">size_t</span>) size * <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));
  b-&gt;n_items += size;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_mem_blob_read_sparse</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">b</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                             <span style="color: #228b22;">int32_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">index</span>, <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">value</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof</span>)
{
  <span style="color: #a020f0;">if</span> (b == <span style="color: #008b8b;">NULL</span> || offset &gt;= b-&gt;n_items) { *eof = 0L; <span style="color: #a020f0;">return</span> TREXIO_END; }
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">avail</span> = b-&gt;n_items - offset;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">n</span> = (size &lt;= avail) ? size : avail;
  memcpy(index, b-&gt;index + offset * b-&gt;rank, (<span style="color: #228b22;">size_t</span>) n * (<span style="color: #228b22;">size_t</span>) b-&gt;rank * <span style="color: #a020f0;">sizeof</span>(int32_t));
  memcpy(value, b-&gt;value + offset, (<span style="color: #228b22;">size_t</span>) n * <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));
  <span style="color: #a020f0;">if</span> (n &lt; size) { *eof = n; <span style="color: #a020f0;">return</span> TREXIO_END; }
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_mem_blob_append_value</span> (<span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">b</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">value</span>)
{
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = trexio_mem_blob_reserve(b, b-&gt;n_items + size, <span style="color: #008b8b;">false</span>, <span style="color: #008b8b;">false</span>, <span style="color: #008b8b;">true</span>);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;
  memcpy(b-&gt;value + b-&gt;n_items, value, (<span style="color: #228b22;">size_t</span>) size * <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));
  b-&gt;n_items += size;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_mem_blob_read_value</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">b</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                            <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">value</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof</span>)
{
  <span style="color: #a020f0;">if</span> (b == <span style="color: #008b8b;">NULL</span> || offset &gt;= b-&gt;n_items) { *eof = 0L; <span style="color: #a020f0;">return</span> TREXIO_END; }
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">avail</span> = b-&gt;n_items - offset;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">n</span> = (size &lt;= avail) ? size : avail;
  memcpy(value, b-&gt;value + offset, (<span style="color: #228b22;">size_t</span>) n * <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));
  <span style="color: #a020f0;">if</span> (n &lt; size) { *eof = n; <span style="color: #a020f0;">return</span> TREXIO_END; }
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_mem_blob_append_list</span> (<span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">b</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">list</span>)
{
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = trexio_mem_blob_reserve(b, b-&gt;n_items + size, <span style="color: #008b8b;">false</span>, <span style="color: #008b8b;">true</span>, <span style="color: #008b8b;">false</span>);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;
  memcpy(b-&gt;list + b-&gt;n_items * b-&gt;rank, list, (<span style="color: #228b22;">size_t</span>) size * (<span style="color: #228b22;">size_t</span>) b-&gt;rank * <span style="color: #a020f0;">sizeof</span>(int64_t));
  b-&gt;n_items += size;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_mem_blob_read_list</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">b</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                           <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">list</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof</span>)
{
  <span style="color: #a020f0;">if</span> (b == <span style="color: #008b8b;">NULL</span> || offset &gt;= b-&gt;n_items) { *eof = 0L; <span style="color: #a020f0;">return</span> TREXIO_END; }
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">avail</span> = b-&gt;n_items - offset;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">n</span> = (size &lt;= avail) ? size : avail;
  memcpy(list, b-&gt;list + offset * b-&gt;rank, (<span style="color: #228b22;">size_t</span>) n * (<span style="color: #228b22;">size_t</span>) b-&gt;rank * <span style="color: #a020f0;">sizeof</span>(int64_t));
  <span style="color: #a020f0;">if</span> (n &lt; size) { *eof = n; <span style="color: #a020f0;">return</span> TREXIO_END; }
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_inquire</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">file_name</span>)
{
  /* <span style="color: #b22222;">In-memory files do not persist on disk and are never pre-existing.</span> */
  (<span style="color: #228b22;">void</span>) file_name;
  <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_init</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_memory_t</span>*) file;

  /* <span style="color: #b22222;">Put all pointers to NULL but leave parent untouched</span> */
  memset(&amp;(f-&gt;parent)+1, 0, <span style="color: #a020f0;">sizeof</span>(trexio_memory_t)-<span style="color: #a020f0;">sizeof</span>(trexio_t));

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_lock</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  /* <span style="color: #b22222;">Nothing to lock for an in-memory, single-process file.</span> */
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_unlock</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>
</div>
</div>
