src/templates_memory/templator_memory.org
* Deinitialize function (templated part)

    #+begin_src c :tangle basic_memory_group.c
trexio_exit_code
trexio_memory_deinit (trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  trexio_exit_code rc;

  /* Free the in-RAM blob store (sparse / buffered / determinant data). */
  trexio_mem_blob_free_all((trexio_memory_t*) file);

  /* Error handling for this call is added by the generator */
  rc = trexio_memory_free_$group$( (trexio_memory_t*) file);

  return TREXIO_SUCCESS;
}
    #+end_src

* Flush function (templated part)

    #+begin_src c :tangle basic_memory_group.c
trexio_exit_code
trexio_memory_flush (trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  trexio_exit_code rc;
  trexio_memory_t* f = (trexio_memory_t*) file;

  rc = trexio_memory_flush_$group$(f); if (rc != TREXIO_SUCCESS) return rc;

  return TREXIO_SUCCESS;
}
    #+end_src

* Template for memory read a group

    #+begin_src c :tangle read_group_memory.h :exports none
$group$_mem_t* trexio_memory_read_$group$(trexio_memory_t* const file);
    #+end_src

    #+begin_src c :tangle read_group_memory.c
$group$_mem_t*
trexio_memory_read_$group$ (trexio_memory_t* const file)
{
  if (file == NULL) return NULL;

  /* If the data structure exists, return it; otherwise create an empty one.
     There is no file to read from for the in-memory back end. */
  if (file->$group$ != NULL) {
    return file->$group$;
  }

  $group$_mem_t* $group$ = MALLOC($group$_mem_t);
  if ($group$ == NULL) return NULL;

  memset($group$, 0, sizeof($group$_mem_t));

  file->$group$ = $group$;
  return $group$;
}
   #+end_src

* Template for memory has a group

    #+begin_src c :tangle hrw_group_memory.h :exports none
trexio_exit_code trexio_memory_has_$group$(trexio_t* const file);
    #+end_src

    #+begin_src c :tangle has_group_memory.c
trexio_exit_code
trexio_memory_has_$group$ (trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  trexio_memory_t* const f = (trexio_memory_t*) file;

  if (f->$group$ != NULL) {
    return TREXIO_SUCCESS;
  } else {
    return TREXIO_HAS_NOT;
  }
}
   #+end_src

* Template for memory flush a group

    #+begin_src c :tangle flush_group_memory.h :exports none
trexio_exit_code trexio_memory_flush_$group$(trexio_memory_t* const file);
    #+end_src

    #+begin_src c :tangle flush_group_memory.c
trexio_exit_code
trexio_memory_flush_$group$ (trexio_memory_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  if (file->parent.mode == 'r') return TREXIO_READONLY;

  /* Nothing to flush: the data already lives in memory. */
  if (file->$group$ != NULL) file->$group$->to_flush = 0;

  return TREXIO_SUCCESS;
}
   #+end_src

* Template for memory free memory

    #+begin_src c :tangle free_group_memory.h :exports none
trexio_exit_code trexio_memory_free_$group$(trexio_memory_t* const file);
    #+end_src

    #+begin_src c :tangle free_group_memory.c
trexio_exit_code
trexio_memory_free_$group$ (trexio_memory_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  $group$_mem_t* $group$ = file->$group$;
  if ($group$ == NULL) return TREXIO_SUCCESS;

  // START REPEAT GROUP_DSET_NUM
  if ($group$->$group_dset$ != NULL) FREE ($group$->$group_dset$);
  // END REPEAT GROUP_DSET_NUM

  // START REPEAT GROUP_DSET_STR
  if ($group$->$group_dset$ != NULL) {
    if ($group$->rank_$group_dset$ != 0) FREE ($group$->$group_dset$[0]);
    FREE ($group$->$group_dset$);
  }
  // END REPEAT GROUP_DSET_STR

  // START REPEAT GROUP_ATTR_STR
  if ($group$->$group_str$ != NULL) FREE ($group$->$group_str$);
  // END REPEAT GROUP_ATTR_STR

  FREE ($group$);
  file->$group$ = NULL;

  return TREXIO_SUCCESS;
}
    #+end_src

