templator_memory.html

<div id="outline-container-orgc79375f" class="outline-2">
<h2 id="orgc79375f"><span class="section-number-2">4.</span> Deinitialize function (templated part)</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_deinit</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;

  /* <span style="color: #b22222;">Free the in-RAM blob store (sparse / buffered / determinant data).</span> */
  trexio_mem_blob_free_all((<span style="color: #228b22;">trexio_memory_t</span>*) file);

  /* <span style="color: #b22222;">Error handling for this call is added by the generator</span> */
  rc = trexio_memory_free_$group$( (<span style="color: #228b22;">trexio_memory_t</span>*) file);

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4b87c9" class="outline-2">
<h2 id="orge4b87c9"><span class="section-number-2">5.</span> Flush function (templated part)</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_flush</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;
  <span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_memory_t</span>*) file;

  rc = trexio_memory_flush_$group$(f); <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad1b834" class="outline-2">
<h2 id="orgad1b834"><span class="section-number-2">6.</span> Template for memory read a group</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-c">$group$_mem_t*
trexio_memory_read_$group$ (<span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;

  /* <span style="color: #b22222;">If the data structure exists, return it; otherwise create an empty one.
     There is no file to read from for the in-memory back end.</span> */
  <span style="color: #a020f0;">if</span> (file-&gt;$group$ != <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> file-&gt;$group$;
  }

  $group$_mem_t* $group$ = MALLOC($group$_mem_t);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;

  memset($group$, 0, <span style="color: #a020f0;">sizeof</span>($group$_mem_t));

  file-&gt;$group$ = $group$;
  <span style="color: #a020f0;">return</span> $group$;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgace0509" class="outline-2">
<h2 id="orgace0509"><span class="section-number-2">7.</span> Template for memory has a group</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_has_$group$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_memory_t</span>*) file;

  <span style="color: #a020f0;">if</span> (f-&gt;$group$ != <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_HAS_NOT;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f85674" class="outline-2">
<h2 id="org3f85674"><span class="section-number-2">8.</span> Template for memory flush a group</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_flush_$group$</span> (<span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #a020f0;">if</span> (file-&gt;parent.mode == <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">return</span> TREXIO_READONLY;

  /* <span style="color: #b22222;">Nothing to flush: the data already lives in memory.</span> */
  <span style="color: #a020f0;">if</span> (file-&gt;$group$ != <span style="color: #008b8b;">NULL</span>) file-&gt;$group$-&gt;to_flush = 0;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7aa26e" class="outline-2">
<h2 id="orgc7aa26e"><span class="section-number-2">9.</span> Template for memory free memory</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_free_$group$</span> (<span style="color: #228b22;">trexio_memory_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  $group$_mem_t* $group$ = file-&gt;$group$;
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

  // <span style="color: #b22222;">START REPEAT GROUP_DSET_NUM
</span>  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_dset$ != <span style="color: #008b8b;">NULL</span>) FREE ($group$-&gt;$group_dset$);
  // <span style="color: #b22222;">END REPEAT GROUP_DSET_NUM
</span>
  // <span style="color: #b22222;">START REPEAT GROUP_DSET_STR
</span>  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_dset$ != <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">if</span> ($group$-&gt;rank_$group_dset$ != 0) FREE ($group$-&gt;$group_dset$[0]);
    FREE ($group$-&gt;$group_dset$);
  }
  // <span style="color: #b22222;">END REPEAT GROUP_DSET_STR
</span>
  // <span style="color: #b22222;">START REPEAT GROUP_ATTR_STR
</span>  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_str$ != <span style="color: #008b8b;">NULL</span>) FREE ($group$-&gt;$group_str$);
  // <span style="color: #b22222;">END REPEAT GROUP_ATTR_STR
</span>
  FREE ($group$);
  file-&gt;$group$ = <span style="color: #008b8b;">NULL</span>;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>
</div>
</div>
