src/templates_memory/templator_memory.org
* Template for has/read/write a numerical attribute

    #+begin_src c :tangle hrw_attr_num_memory.h :exports none
trexio_exit_code trexio_memory_has_$group_num$ (trexio_t* const file);
trexio_exit_code trexio_memory_read_$group_num$ (trexio_t* const file, $group_num_dtype_double$* const num);
trexio_exit_code trexio_memory_write_$group_num$(trexio_t* const file, const $group_num_dtype_double$ num);
   #+end_src

    #+begin_src c :tangle read_attr_num_memory.c
trexio_exit_code
trexio_memory_read_$group_num$ (trexio_t* const file, $group_num_dtype_double$* const num)
{
  if (file  == NULL) return TREXIO_INVALID_ARG_1;
  if (num   == NULL) return TREXIO_INVALID_ARG_2;

  $group$_mem_t* $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  *num = $group$->$group_num$;

  return TREXIO_SUCCESS;
}
   #+end_src

   #+begin_src c :tangle write_attr_num_memory.c
trexio_exit_code
trexio_memory_write_$group_num$ (trexio_t* const file, const $group_num_dtype_double$ num)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (file->mode == 'r') return TREXIO_READONLY;

  $group$_mem_t* $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  $group$->$group_num$ = num;
  $group$->$group_num$_isSet = true;
  $group$->to_flush = 1;

  return TREXIO_SUCCESS;
}
     #+end_src

    #+begin_src c :tangle has_attr_num_memory.c
trexio_exit_code
trexio_memory_has_$group_num$ (trexio_t* const file)
{
  if (file  == NULL) return TREXIO_INVALID_ARG_1;

  $group$_mem_t* $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  if ($group$->$group_num$_isSet == true){
    return TREXIO_SUCCESS;
  } else {
    return TREXIO_HAS_NOT;
  }
}
   #+end_src

* Template for has/read/write a dataset of numerical data

   #+begin_src c :tangle hrw_dset_data_memory.h :exports none
trexio_exit_code trexio_memory_has_$group_dset$ (trexio_t* const file);
trexio_exit_code trexio_memory_read_$group_dset$ (trexio_t* const file, $group_dset_dtype$* const $group_dset$, const uint32_t rank, const uint64_t* dims);
trexio_exit_code trexio_memory_write_$group_dset$(trexio_t* const file, const $group_dset_dtype$* $group_dset$, const uint32_t rank, const uint64_t* dims);
   #+end_src

   #+begin_src c :tangle read_dset_data_memory.c
trexio_exit_code
trexio_memory_read_$group_dset$ (trexio_t* const file, $group_dset_dtype$* const $group_dset$,
                                 const uint32_t rank, const uint64_t* dims)
{
  if (file  == NULL) return TREXIO_INVALID_ARG_1;
  if ($group_dset$ == NULL) return TREXIO_INVALID_ARG_2;
  if (rank < 1) return TREXIO_INVALID_ARG_3;
  if (dims == NULL) return TREXIO_INVALID_ARG_4;

  $group$_mem_t* const $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  if (rank != $group$->rank_$group_dset$) return TREXIO_INVALID_ARG_3;

  uint64_t dim_size = 1;
  for (uint32_t i=0; i<rank; ++i){
    if (dims[i] != $group$->dims_$group_dset$[i]) return TREXIO_INVALID_ARG_4;
    dim_size *= dims[i];
  }

  for (uint64_t i=0 ; i<dim_size ; ++i) {
    $group_dset$[i] = $group$->$group_dset$[i];
  }

  return TREXIO_SUCCESS;
}
   #+end_src

   #+begin_src c :tangle write_dset_data_memory.c
trexio_exit_code
trexio_memory_write_$group_dset$ (trexio_t* const file, const $group_dset_dtype$* $group_dset$,
                                  const uint32_t rank, const uint64_t* dims)
{
  if (file  == NULL)  return TREXIO_INVALID_ARG_1;
  if ($group_dset$ == NULL)  return TREXIO_INVALID_ARG_2;
  if (rank < 1) return TREXIO_INVALID_ARG_3;
  if (dims == NULL) return TREXIO_INVALID_ARG_4;

  if (file->mode == 'r') return TREXIO_READONLY;

  $group$_mem_t* const $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  if ($group$->$group_dset$ != NULL) {
    FREE($group$->$group_dset$);
  }

  $group$->rank_$group_dset$ = rank;

  uint64_t dim_size = 1;
  for (uint32_t i=0; i<$group$->rank_$group_dset$; ++i){
    $group$->dims_$group_dset$[i] = dims[i];
    dim_size *= dims[i];
  }

  $group$->$group_dset$ = CALLOC(dim_size, $group_dset_dtype$);
  if ($group$->$group_dset$ == NULL) return TREXIO_ALLOCATION_FAILED;

  for (uint64_t i=0 ; i<dim_size ; ++i) {
    $group$->$group_dset$[i] = $group_dset$[i];
  }

  $group$->to_flush = 1;
  return TREXIO_SUCCESS;
}
   #+end_src

   #+begin_src c :tangle has_dset_data_memory.c
trexio_exit_code
trexio_memory_has_$group_dset$ (trexio_t* const file)
{
  if (file  == NULL) return TREXIO_INVALID_ARG_1;

  $group$_mem_t* const $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  if ($group$->rank_$group_dset$ > 0){
    return TREXIO_SUCCESS;
  } else {
    return TREXIO_HAS_NOT;
  }
}
   #+end_src

