templator_memory.html

<div id="outline-container-org678e6e3" class="outline-2">
<h2 id="org678e6e3"><span class="section-number-2">10.</span> Template for has/read/write a numerical attribute</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_read_$group_num$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, $group_num_dtype_double$* <span style="color: #a020f0;">const</span> num)
{
  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (num   == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;

  $group$_mem_t* $group$ = trexio_memory_read_$group$((<span style="color: #228b22;">trexio_memory_t</span>*) file);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  *num = $group$-&gt;$group_num$;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_write_$group_num$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> $group_num_dtype_double$ num)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (file-&gt;mode == <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">return</span> TREXIO_READONLY;

  $group$_mem_t* $group$ = trexio_memory_read_$group$((<span style="color: #228b22;">trexio_memory_t</span>*) file);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  $group$-&gt;$group_num$ = num;
  $group$-&gt;$group_num$_isSet = <span style="color: #008b8b;">true</span>;
  $group$-&gt;to_flush = 1;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_has_$group_num$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  $group$_mem_t* $group$ = trexio_memory_read_$group$((<span style="color: #228b22;">trexio_memory_t</span>*) file);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_num$_isSet == <span style="color: #008b8b;">true</span>){
    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_HAS_NOT;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3532b76" class="outline-2">
<h2 id="org3532b76"><span class="section-number-2">11.</span> Template for has/read/write a dataset of numerical data</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_read_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, $group_dset_dtype$* <span style="color: #a020f0;">const</span> $group_dset$,
                                 <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>)
{
  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> ($group_dset$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (rank &lt; 1) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;
  <span style="color: #a020f0;">if</span> (dims == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_4;

  $group$_mem_t* <span style="color: #a020f0;">const</span> $group$ = trexio_memory_read_$group$((<span style="color: #228b22;">trexio_memory_t</span>*) file);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #a020f0;">if</span> (rank != $group$-&gt;rank_$group_dset$) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;

  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dim_size</span> = 1;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;rank; ++i){
    <span style="color: #a020f0;">if</span> (dims[i] != $group$-&gt;dims_$group_dset$[i]) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_4;
    dim_size *= dims[i];
  }

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;dim_size ; ++i) {
    $group_dset$[i] = $group$-&gt;$group_dset$[i];
  }

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_write_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> $group_dset_dtype$* $group_dset$,
                                  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>)
{
  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>)  <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> ($group_dset$ == <span style="color: #008b8b;">NULL</span>)  <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (rank &lt; 1) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;
  <span style="color: #a020f0;">if</span> (dims == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_4;

  <span style="color: #a020f0;">if</span> (file-&gt;mode == <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">return</span> TREXIO_READONLY;

  $group$_mem_t* <span style="color: #a020f0;">const</span> $group$ = trexio_memory_read_$group$((<span style="color: #228b22;">trexio_memory_t</span>*) file);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_dset$ != <span style="color: #008b8b;">NULL</span>) {
    FREE($group$-&gt;$group_dset$);
  }

  $group$-&gt;rank_$group_dset$ = rank;

  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dim_size</span> = 1;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;$group$-&gt;rank_$group_dset$; ++i){
    $group$-&gt;dims_$group_dset$[i] = dims[i];
    dim_size *= dims[i];
  }

  $group$-&gt;$group_dset$ = CALLOC(dim_size, $group_dset_dtype$);
  <span style="color: #a020f0;">if</span> ($group$-&gt;$group_dset$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;dim_size ; ++i) {
    $group$-&gt;$group_dset$[i] = $group_dset$[i];
  }

  $group$-&gt;to_flush = 1;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_memory_has_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  $group$_mem_t* <span style="color: #a020f0;">const</span> $group$ = trexio_memory_read_$group$((<span style="color: #228b22;">trexio_memory_t</span>*) file);
  <span style="color: #a020f0;">if</span> ($group$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #a020f0;">if</span> ($group$-&gt;rank_$group_dset$ &gt; 0){
    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_HAS_NOT;
  }
}
</pre>
</div>
</div>
</div>
