src/templates_memory/templator_memory.org
* Template for has/read/write a string attribute

   #+begin_src c :tangle hrw_attr_str_memory.h :exports none
trexio_exit_code trexio_memory_has_$group_str$ (trexio_t* const file);
trexio_exit_code trexio_memory_read_$group_str$ (trexio_t* const file, char* const str, const uint32_t max_str_len);
trexio_exit_code trexio_memory_write_$group_str$ (trexio_t* const file, const char* str);
   #+end_src

   #+begin_src c :tangle read_attr_str_memory.c
trexio_exit_code
trexio_memory_read_$group_str$ (trexio_t* const file, char* const str, const uint32_t max_str_len)
{
  if (file  == NULL) return TREXIO_INVALID_ARG_1;
  if (str == NULL) return TREXIO_INVALID_ARG_2;

  $group$_mem_t* const $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  strncpy(str, $group$->$group_str$, max_str_len);
  str[max_str_len-1] = '\0';

  return TREXIO_SUCCESS;
}
   #+end_src

   #+begin_src c :tangle write_attr_str_memory.c
trexio_exit_code
trexio_memory_write_$group_str$ (trexio_t* const file, const char *str)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (str  == NULL) return TREXIO_INVALID_ARG_2;

  if (file->mode == 'r') return TREXIO_READONLY;

  $group$_mem_t* const $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  if ($group$->$group_str$ != NULL) FREE($group$->$group_str$);

  size_t tmp_len = strlen(str);

  $group$->$group_str$ = CALLOC(tmp_len + 1, char);
  if ($group$->$group_str$ == NULL) return TREXIO_ALLOCATION_FAILED;

  $group$->len_$group_str$ = tmp_len + 1;

  strncpy($group$->$group_str$, str, tmp_len + 1);
  $group$->$group_str$[tmp_len] = '\0';

  $group$->to_flush = 1;

  return TREXIO_SUCCESS;
}
   #+end_src

   #+begin_src c :tangle has_attr_str_memory.c
trexio_exit_code
trexio_memory_has_$group_str$ (trexio_t* const file)
{
  if (file  == NULL) return TREXIO_INVALID_ARG_1;

  $group$_mem_t* const $group$ = trexio_memory_read_$group$((trexio_memory_t*) file);
  if ($group$ == NULL) return TREXIO_FAILURE;

  if ($group$->len_$group_str$ > 0){
    return TREXIO_SUCCESS;
  } else {
    return TREXIO_HAS_NOT;
  }
}
   #+end_src

* Template for memory delete a group (UNSAFE mode)

  #+begin_src c :tangle delete_group_memory.h :exports none
trexio_exit_code trexio_memory_delete_$group$ (trexio_t* const file);
  #+end_src

  #+begin_src c :tangle delete_group_memory.c
trexio_exit_code
trexio_memory_delete_$group$ (trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  trexio_memory_t* f = (trexio_memory_t*) file;

  /* Dropping the in-memory struct deletes the group. */
  trexio_exit_code rc_free = trexio_memory_free_$group$(f);
  if (rc_free != TREXIO_SUCCESS) return rc_free;

  return TREXIO_SUCCESS;
}
   #+end_src

