src/templates_memory/templator_memory.org
* Template for has/read/write the dataset of sparse data

   Sparse data (e.g. two-electron integrals, Cholesky vectors, 2-RDMs) is held
   in a name-keyed in-RAM blob of growable index/value arrays. Writing appends;
   reading returns chunks from a given item offset.

   #+begin_src c :tangle hrw_dset_sparse_memory.h :exports none
trexio_exit_code trexio_memory_has_$group_dset$(trexio_t* const file);
trexio_exit_code trexio_memory_read_$group_dset$(trexio_t* const file, const int64_t offset_file, const int64_t size, const int64_t size_max, int64_t* const eof_read_size, int32_t* const index_sparse, double* const value_sparse);
trexio_exit_code trexio_memory_write_$group_dset$(trexio_t* const file, const int64_t offset_file, const int64_t size, const int64_t size_max, const int64_t size_start, const int32_t* index_sparse, const double* value_sparse);
trexio_exit_code trexio_memory_read_$group_dset$_size(trexio_t* const file, int64_t* const size_max);
   #+end_src

   #+begin_src c :tangle write_dset_sparse_memory.c
trexio_exit_code trexio_memory_write_$group_dset$(trexio_t* const file,
                                                  const int64_t offset_file, const int64_t size,
                                                  const int64_t size_max, const int64_t size_start,
                                                  const int32_t* index_sparse, const double* value_sparse)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (file->mode == 'r') return TREXIO_READONLY;
  (void) offset_file; (void) size_max; (void) size_start;

  trexio_mem_blob_t* b = trexio_mem_blob_get((trexio_memory_t*) file, "$group_dset$", $group_dset_rank$);
  if (b == NULL) return TREXIO_ALLOCATION_FAILED;

  return trexio_mem_blob_append_sparse(b, size, index_sparse, value_sparse);
}
   #+end_src

   #+begin_src c :tangle read_dset_sparse_memory.c
trexio_exit_code trexio_memory_read_$group_dset$(trexio_t* const file,
                                                 const int64_t offset_file, const int64_t size,
                                                 const int64_t size_max, int64_t* const eof_read_size,
                                                 int32_t* const index_sparse, double* const value_sparse)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (eof_read_size == NULL) return TREXIO_INVALID_ARG_5;
  (void) size_max;

  trexio_mem_blob_t* b = trexio_mem_blob_find((trexio_memory_t*) file, "$group_dset$");
  return trexio_mem_blob_read_sparse(b, offset_file, size, index_sparse, value_sparse, eof_read_size);
}

trexio_exit_code trexio_memory_read_$group_dset$_size(trexio_t* const file, int64_t* const size_max)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (size_max == NULL) return TREXIO_INVALID_ARG_2;

  trexio_mem_blob_t* b = trexio_mem_blob_find((trexio_memory_t*) file, "$group_dset$");
  *size_max = (b == NULL) ? 0L : b->n_items;
  return TREXIO_SUCCESS;
}
   #+end_src

   #+begin_src c :tangle has_dset_sparse_memory.c
trexio_exit_code trexio_memory_has_$group_dset$(trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  trexio_mem_blob_t* b = trexio_mem_blob_find((trexio_memory_t*) file, "$group_dset$");
  return (b != NULL && b->n_items > 0) ? TREXIO_SUCCESS : TREXIO_HAS_NOT;
}
   #+end_src

