templator_memory.html

<div id="outline-container-org7ba975d" class="outline-2">
<h2 id="org7ba975d"><span class="section-number-2">15.</span> Template for has/read/write the dataset of sparse data</h2>
<div class="outline-text-2" id="text-15">
<p>
Sparse data (e.g. two-electron integrals, Cholesky vectors, 2-RDMs) is held
in a name-keyed in-RAM blob of growable index/value arrays. Writing appends;
reading returns chunks from a given item offset.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_write_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                                  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                                                  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_start</span>,
                                                  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span>* <span style="color: #a0522d;">index_sparse</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">value_sparse</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (file-&gt;mode == <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">return</span> TREXIO_READONLY;
  (<span style="color: #228b22;">void</span>) offset_file; (<span style="color: #228b22;">void</span>) size_max; (<span style="color: #228b22;">void</span>) size_start;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_get((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"$group_dset$"</span>, $group_dset_rank$);
  <span style="color: #a020f0;">if</span> (b == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;

  <span style="color: #a020f0;">return</span> trexio_mem_blob_append_sparse(b, size, index_sparse, value_sparse);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_read_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                                 <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                                                 <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof_read_size</span>,
                                                 <span style="color: #228b22;">int32_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">index_sparse</span>, <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">value_sparse</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (eof_read_size == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;
  (<span style="color: #228b22;">void</span>) size_max;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"$group_dset$"</span>);
  <span style="color: #a020f0;">return</span> trexio_mem_blob_read_sparse(b, offset_file, size, index_sparse, value_sparse, eof_read_size);
}

<span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_read_$group_dset$_size</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">size_max</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (size_max == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"$group_dset$"</span>);
  *size_max = (b == <span style="color: #008b8b;">NULL</span>) ? 0L : b-&gt;n_items;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_has_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"$group_dset$"</span>);
  <span style="color: #a020f0;">return</span> (b != <span style="color: #008b8b;">NULL</span> &amp;&amp; b-&gt;n_items &gt; 0) ? TREXIO_SUCCESS : TREXIO_HAS_NOT;
}
</pre>
</div>
</div>
</div>
