src/templates_memory/templator_memory.org
* Template for has/read/write a buffered vector

   Buffered vectors (e.g. CI/CSF coefficients) are held in a name-keyed in-RAM
   blob of growable values. Writing appends; reading returns a chunk.

   #+begin_src c :tangle hrw_buffered_memory.h :exports none
trexio_exit_code trexio_memory_has_$group_dset$(trexio_t* const file);
trexio_exit_code trexio_memory_read_$group_dset$(trexio_t* const file, const int64_t offset_file, const uint32_t rank, const uint64_t* dims, int64_t* const eof_read_size, double* const dset);
trexio_exit_code trexio_memory_write_$group_dset$(trexio_t* const file, const int64_t offset_file, const uint32_t rank, const uint64_t* dims, const double* dset);
trexio_exit_code trexio_memory_read_$group_dset$_size(trexio_t* const file, int64_t* const size_max);
   #+end_src

   #+begin_src c :tangle write_buffered_memory.c
trexio_exit_code trexio_memory_write_$group_dset$(trexio_t* const file, const int64_t offset_file,
                                                  const uint32_t rank, const uint64_t* dims, const double* dset)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (offset_file < 0) return TREXIO_INVALID_ARG_2;
  if (rank < 1) return TREXIO_INVALID_ARG_3;
  if (dims == NULL) return TREXIO_INVALID_ARG_4;
  if (dset == NULL) return TREXIO_INVALID_ARG_5;
  if (file->mode == 'r') return TREXIO_READONLY;
  (void) offset_file;

  trexio_mem_blob_t* b = trexio_mem_blob_get((trexio_memory_t*) file, "$group_dset$", 1);
  if (b == NULL) return TREXIO_ALLOCATION_FAILED;

  return trexio_mem_blob_append_value(b, (int64_t) dims[0], dset);
}
   #+end_src

   #+begin_src c :tangle read_buffered_memory.c
trexio_exit_code trexio_memory_read_$group_dset$(trexio_t* const file, const int64_t offset_file,
                                                 const uint32_t rank, const uint64_t* dims,
                                                 int64_t* const eof_read_size, double* const dset)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (offset_file < 0) return TREXIO_INVALID_ARG_2;
  if (rank < 1) return TREXIO_INVALID_ARG_3;
  if (dims == NULL) return TREXIO_INVALID_ARG_4;
  if (eof_read_size == NULL) return TREXIO_INVALID_ARG_5;
  if (dset == NULL) return TREXIO_INVALID_ARG_6;

  trexio_mem_blob_t* b = trexio_mem_blob_find((trexio_memory_t*) file, "$group_dset$");
  return trexio_mem_blob_read_value(b, offset_file, (int64_t) dims[0], dset, eof_read_size);
}

trexio_exit_code trexio_memory_read_$group_dset$_size(trexio_t* const file, int64_t* const size_max)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (size_max == NULL) return TREXIO_INVALID_ARG_2;

  trexio_mem_blob_t* b = trexio_mem_blob_find((trexio_memory_t*) file, "$group_dset$");
  *size_max = (b == NULL) ? 0L : b->n_items;
  return TREXIO_SUCCESS;
}
   #+end_src

   #+begin_src c :tangle has_buffered_memory.c
trexio_exit_code trexio_memory_has_$group_dset$(trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  trexio_mem_blob_t* b = trexio_mem_blob_find((trexio_memory_t*) file, "$group_dset$");
  return (b != NULL && b->n_items > 0) ? TREXIO_SUCCESS : TREXIO_HAS_NOT;
}
   #+end_src

