templator_memory.html

<div id="outline-container-org6f151d6" class="outline-2">
<h2 id="org6f151d6"><span class="section-number-2">16.</span> Template for has/read/write a buffered vector</h2>
<div class="outline-text-2" id="text-16">
<p>
Buffered vectors (e.g. CI/CSF coefficients) are held in a name-keyed in-RAM
blob of growable values. Writing appends; reading returns a chunk.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_write_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">dset</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (offset_file &lt; 0) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (rank &lt; 1) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;
  <span style="color: #a020f0;">if</span> (dims == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_4;
  <span style="color: #a020f0;">if</span> (dset == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;
  <span style="color: #a020f0;">if</span> (file-&gt;mode == <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">return</span> TREXIO_READONLY;
  (<span style="color: #228b22;">void</span>) offset_file;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_get((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"$group_dset$"</span>, 1);
  <span style="color: #a020f0;">if</span> (b == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;

  <span style="color: #a020f0;">return</span> trexio_mem_blob_append_value(b, (<span style="color: #228b22;">int64_t</span>) dims[0], dset);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_read_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                 <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>,
                                                 <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof_read_size</span>, <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">dset</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (offset_file &lt; 0) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (rank &lt; 1) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;
  <span style="color: #a020f0;">if</span> (dims == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_4;
  <span style="color: #a020f0;">if</span> (eof_read_size == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;
  <span style="color: #a020f0;">if</span> (dset == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_6;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"$group_dset$"</span>);
  <span style="color: #a020f0;">return</span> trexio_mem_blob_read_value(b, offset_file, (<span style="color: #228b22;">int64_t</span>) dims[0], dset, eof_read_size);
}

<span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_read_$group_dset$_size</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">size_max</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (size_max == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"$group_dset$"</span>);
  *size_max = (b == <span style="color: #008b8b;">NULL</span>) ? 0L : b-&gt;n_items;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_has_$group_dset$</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"$group_dset$"</span>);
  <span style="color: #a020f0;">return</span> (b != <span style="color: #008b8b;">NULL</span> &amp;&amp; b-&gt;n_items &gt; 0) ? TREXIO_SUCCESS : TREXIO_HAS_NOT;
}
</pre>
</div>
</div>
</div>
