src/templates_memory/templator_memory.org
* Source code for the determinant part

   The determinant list (bit-field occupation strings) is stored in a single
   name-keyed in-RAM blob of int64 values; the coefficients use the buffered
   mechanism above. These functions are constant (not templated).

   #+begin_src c :tangle hrw_determinant_memory.h :exports none
trexio_exit_code trexio_memory_has_determinant_list(trexio_t* const file);
trexio_exit_code trexio_memory_read_determinant_list(trexio_t* const file, const int64_t offset_file, const uint32_t rank, const uint64_t* dims, int64_t* const eof_read_size, int64_t* const list);
trexio_exit_code trexio_memory_write_determinant_list(trexio_t* const file, const int64_t offset_file, const uint32_t rank, const uint64_t* dims, const int64_t* list);
   #+end_src

   #+begin_src c :tangle write_determinant_memory.c
trexio_exit_code trexio_memory_write_determinant_list(trexio_t* const file, const int64_t offset_file,
                                                      const uint32_t rank, const uint64_t* dims, const int64_t* list)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (offset_file < 0) return TREXIO_INVALID_ARG_2;
  if (rank != 2) return TREXIO_INVALID_ARG_3;
  if (dims == NULL) return TREXIO_INVALID_ARG_4;
  if (list == NULL) return TREXIO_INVALID_ARG_5;
  if (file->mode == 'r') return TREXIO_READONLY;
  (void) offset_file;

  trexio_mem_blob_t* b = trexio_mem_blob_get((trexio_memory_t*) file, "determinant_list", (int32_t) dims[1]);
  if (b == NULL) return TREXIO_ALLOCATION_FAILED;

  return trexio_mem_blob_append_list(b, (int64_t) dims[0], list);
}
   #+end_src

   #+begin_src c :tangle read_determinant_memory.c
trexio_exit_code trexio_memory_read_determinant_list(trexio_t* const file, const int64_t offset_file,
                                                     const uint32_t rank, const uint64_t* dims,
                                                     int64_t* const eof_read_size, int64_t* const list)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;
  if (offset_file < 0) return TREXIO_INVALID_ARG_2;
  if (rank != 2) return TREXIO_INVALID_ARG_3;
  if (dims == NULL) return TREXIO_INVALID_ARG_4;
  if (eof_read_size == NULL) return TREXIO_INVALID_ARG_5;
  if (list == NULL) return TREXIO_INVALID_ARG_6;

  trexio_mem_blob_t* b = trexio_mem_blob_find((trexio_memory_t*) file, "determinant_list");
  return trexio_mem_blob_read_list(b, offset_file, (int64_t) dims[0], list, eof_read_size);
}
   #+end_src

   #+begin_src c :tangle has_determinant_memory.c
trexio_exit_code trexio_memory_has_determinant_list(trexio_t* const file)
{
  if (file == NULL) return TREXIO_INVALID_ARG_1;

  trexio_mem_blob_t* b = trexio_mem_blob_find((trexio_memory_t*) file, "determinant_list");
  return (b != NULL && b->n_items > 0) ? TREXIO_SUCCESS : TREXIO_HAS_NOT;
}
   #+end_src

* Constant file suffixes (not used by the generator)               :noexport:

  #+begin_src c :tangle suffix_memory.h
#endif
  #+end_src
