templator_memory.html

<div id="outline-container-orgd5d8a4a" class="outline-2">
<h2 id="orgd5d8a4a"><span class="section-number-2">17.</span> Source code for the determinant part</h2>
<div class="outline-text-2" id="text-17">
<p>
The determinant list (bit-field occupation strings) is stored in a single
name-keyed in-RAM blob of int64 values; the coefficients use the buffered
mechanism above. These functions are constant (not templated).
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_write_determinant_list</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">list</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (offset_file &lt; 0) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (rank != 2) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;
  <span style="color: #a020f0;">if</span> (dims == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_4;
  <span style="color: #a020f0;">if</span> (list == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;
  <span style="color: #a020f0;">if</span> (file-&gt;mode == <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">return</span> TREXIO_READONLY;
  (<span style="color: #228b22;">void</span>) offset_file;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_get((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"determinant_list"</span>, (<span style="color: #228b22;">int32_t</span>) dims[1]);
  <span style="color: #a020f0;">if</span> (b == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;

  <span style="color: #a020f0;">return</span> trexio_mem_blob_append_list(b, (<span style="color: #228b22;">int64_t</span>) dims[0], list);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_read_determinant_list</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                                     <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">dims</span>,
                                                     <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof_read_size</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">list</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (offset_file &lt; 0) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (rank != 2) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;
  <span style="color: #a020f0;">if</span> (dims == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_4;
  <span style="color: #a020f0;">if</span> (eof_read_size == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;
  <span style="color: #a020f0;">if</span> (list == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_6;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"determinant_list"</span>);
  <span style="color: #a020f0;">return</span> trexio_mem_blob_read_list(b, offset_file, (<span style="color: #228b22;">int64_t</span>) dims[0], list, eof_read_size);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span> <span style="color: #0000ff;">trexio_memory_has_determinant_list</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_mem_blob_t</span>* <span style="color: #a0522d;">b</span> = trexio_mem_blob_find((<span style="color: #228b22;">trexio_memory_t</span>*) file, <span style="color: #8b2252;">"determinant_list"</span>);
  <span style="color: #a020f0;">return</span> (b != <span style="color: #008b8b;">NULL</span> &amp;&amp; b-&gt;n_items &gt; 0) ? TREXIO_SUCCESS : TREXIO_HAS_NOT;
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2026-06-26 Fri 11:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
